Public Attributes | List of all members
API_AM_VisibilitySettings Struct Reference
Analytical Model
Describes the Analytical Model Visiblity Settings. More...
#include <APIdefs_AnalyticalModel.h>
 Public Attributes
 API_AM_VisibilityMode  | visibilityMode = API_AM_VisibilityMode::AnalyticalModelOnly
 bool  | isAnalyticalModelVisible = false
 bool  | areMembersTransparent = false
 bool  | areSymbolsTransparent = false
 bool  | areNodesVisible = false
 bool  | areReleasesVisible = false
 bool  | areCrossSectionsVisible = false
 bool  | areCoordinationProfilesVisible = false
 bool  | areLocalCoordSystemsVisible = false
 API_LoadVisibilityMode  | loadVisibilityMode
Visiblity mode of the Loads in the Analytical Model.
Detailed Description
Describes the Analytical Model Visiblity Settings.
Since
Archicad 26